var local_database = [
    {
        id: 1,
        date: "Sep 18 2019",
        title: "缺        口",
    imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=af2831f8322b7bc89222814fc86f64de&imgtype=0&src=http%3A%2F%2Fi3.sinaimg.cn%2Fgm%2Fo%2Fi%2F2008-09-03%2FU1901P115T41D148033F757DT20080903105357.jpg",
        avatar: "/images/avatar/1.png",
        content: "以后我们的关系就这样吧，如果接下来的日子里你不找我，那么我也不会主动找你，直到慢慢的没有交集。你的微信我不会删，电话也不会删，因为毕竟我们爱过。如果你给我发消息我还是会秒回你。但是没有任何期待了。我会放下手机继续等待。如果你来，我还是会原地等你，但这次我不知道会等多久，因为等一个人的期限是有限的，我也说不出你哪里好？只是你给了我别人给不了的感觉。",
        reading: "112",
        collection: "96",
    headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=af2831f8322b7bc89222814fc86f64de&imgtype=0&src=http%3A%2F%2Fi3.sinaimg.cn%2Fgm%2Fo%2Fi%2F2008-09-03%2FU1901P115T41D148033F757DT20080903105357.jpg",
        author: "林白衣",
        dateTime: "24小时前",
        detail: "最近在抖音上被这样一句话刷屏了：“以后我们的关系就这样吧，如果接下来的日子里你不找我，那么我也不会主动找你，直到慢慢的没有交集。你的微信我不会删，电话也不会删，因为毕竟我们爱过。如果你给我发消息我还是会秒回你。但是没有任何期待了。我会放下手机继续等待。如果你来，我还是会原地等你，但这次我不知道会等多久，因为等一个人的期限是有限的，我也说不出你哪里好？只是你给了我别人给不了的感觉。”\n\n  我想写下这段话的那个人也曾全力以赴的付出过、满心欢喜的期待过吧！当一次次怀抱满心欢喜的期待，一次次的让自己的底线撕开一道道缺口，当那一次次期待变为一次次的失望，也就学着去转身了。我们每个人何尝不是这样呢？都以为某时某刻的温暖可以长久、可以完美到无懈可击。我们都期待故事能以完的结局划上句号，可这样的概率又有多少呢？\n\n  曾经我也天真地认为只要我足够努力我们的故事就会有好的结局，可现实给了我当头一击。曾经真的能拍着胸脯说我们是一辈子互相牵挂的人，是一辈子有说不完话的人，是一辈子我累了或者你累了可以相互依靠的人，是一辈子我说我需要一个肩膀了你会出现让我靠的人，我们一辈子会在彼此看得见的地方守护着彼此。可走着走着好像丢了好多，我不知道是我弄丢了你还是你弄丢了我？可总归是丢了……\n\n  曾几何时我们是那么的无话不谈，我们总是有说不完的话，讨论不完的问题。我也相信了以后，我曾把你的到来当做生命中的小确幸，你给的一点点好我都想炫耀，也记得你风尘仆仆的从另一个城市开车到我路过的城市只为在车站见一面，只为那几个小时的相见你说你一夜没睡冒着雨开车赶过来了，也记得你每次的秒回和主动，也记得和你一次次通话两个小时你的叮咛和嘱咐……在那一刻我尽看到了以后，也相信了你说的即使再怎么难也不会丢下我、也不会放开我的手。那一刻我也相信了我和别人的不一样，我也相信了你说承诺那一刻的真诚，可一颗真心终究敌不过距离和时间的挑唆，最后我们的关系也就这样了！你也没主动找过我，我也没有主动找过你……我还是在原地等你，可你却就那样连一句道别也没有。我知道从熬夜回复信息开始你就在我的生活中打开了一条缺口，你走了这个缺口却在那里。这个缺口就是改变习惯、放弃自己、就是我给你的太在乎……\n\n  就像有人说过：在几米的世界里，向左走，向右走，爱与错过，一步之遥；在现实生活里，信任与狗血，爱与恨，一步之遥。就是这一步之遥打开了我人生的的缺口，你就是那个永远也填满不了的缺口，撕裂开的的那一道道口子随着时间会有愈合的时候可那清晰可见的疤痕却也无法修补。\n\n  “我也说不出来你哪里好？只是你给了我别人给不了的感觉。”就像某些人，像坏习惯，戒不掉，也改不了。你给的那道缺口，就像你给的满心欢喜一样，那么深刻，那么猝不及防。\n\n  我们终究没有了交集，就像你我的遇见有些猝不及防，一切顺其自然、简单又美好。从陌生人变回陌生人，这就是我们的故事。\n\n  就像有人说过：其实想想，这个世界从不缺好的故事，故事的结局，静香没有嫁给大雄，晴子可能也就负责打开樱木花道的初恋大门，有人曾牵手，但不会走到最后。就像刚好在赶不同的列车，可能就与缘分失之交臂，抑或是原本以为能长久同行的人，结果提前下车了，看似遗憾，但人生海海，总要允许有人错过你，才能赶上最好的相遇。\n\n  是啊！故事的开头那么美好，故事的结尾却总是有失望。就像你走后的那道缺口看不见也摸不着可它曾是我如烟花般的满心欢喜。我知道这个缺口在遇见你时就已经打开了，只不过遇见你时打开的那个缺口是让步、是包容、是一次次的打破底线。你用我打开的缺口治好了我的忧郁，而后留下更深的缺口让我悲伤。忧郁和悲伤之间的片刻喜欢，便是这个缺口愈合不了的后遗症。\n\n  开始说好有过永远的两个人，后来却不再联系。这是你留给我的缺口，我曾想着这个缺口你会填满，所以我收起了自己的锋芒和戾气希望你来给这个缺口添上色彩，可色彩耀眼的东西终归不能逗留太长时间。虽然以后的缺口再无色彩可我还是很庆幸生命中有那一道缺口。也是有了这个缺口我知道你来过，我知道正是这一段段风格迥异的缺口使我的生命有了另一种色彩。\n\n  也许岁月会掩盖那些你曾到来和走后的缺口，可我还是想说：谢谢你给我的那些从前，谢谢你走后留给我的缺口，我会把那一道道缺口都交给时间，也许时间会给我一个可能，也是这个缺口让我为自己留下了一片天空。\n\n  我不苛求完美的人生，我知道遇上你错过你我的人生已经变得不完美了，可我还是无憾了，“我还是会等你，但这次我不知道等多久，因为等一个人是有期限的……”最终那道撕裂的缺口没被你填满可我也不会再无期限的让它去裂开了。\n\n  你给的缺口是满心欢喜也是忧郁和悲伤……。撕裂便会疼痛但也无法愈合……",
        postId: 0,
        collectFlag: false,
        shareFlag: false,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/3519cdb70c14a95076e8c006c7226963/599516462/599516462.mp3?xcode=4898ada8aa7ac5726b73a0f684021956",
            title: "海阔天空",
            coverImg: "http://qukufile2.qianqian.com/data2/pic/88582702/88582702.jpg@s_2,w_500,h_500"
        }
    },
    {
        id: 2,
        title: "后来，我瞒着所有人爱了你很久很久",
        content: "你知道吗？我昨晚又梦到你了，梦中的你一如既往地帅气，你背对着我，坐在那家我们常去的咖啡馆常坐的位置，我进门径直朝着那个位置走去，却看到了你，我就愣在那儿停顿了好久，然后你转过头来看到了我，你朝我笑，我鼓起勇气试着向你走近，却始终走不到那个位置，眼睁睁地看着你近在咫尺，却偏偏难以靠近，最后直到你消失不见。",
      imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=b0f8cff98c5591d5c581401dc548f2cb&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fblog%2F201404%2F27%2F20140427225617_GGKAH.thumb.700_0.jpeg",
        reading: 62,
        detail: "你知道吗？我昨晚又梦到你了，梦中的你一如既往地帅气，你背对着我，坐在那家我们常去的咖啡馆常坐的位置，我进门径直朝着那个位置走去，却看到了你，我就愣在那儿停顿了好久，然后你转过头来看到了我，你朝我笑，我鼓起勇气试着向你走近，却始终走不到那个位置，眼睁睁地看着你近在咫尺，却偏偏难以靠近，最后直到你消失不见。\n\n我猛然醒来，睁眼，漆黑，宁静，我放空了几秒，然后才终于认清你已经离开我的事实。是啊，已经离开了。\n\n都说，梦中梦到的人，是因为心底觉得离得好远，所以我才会想要在梦中再见见你，可是，在梦中你也离得我好远，我怎么也靠不近你。\n\n也许是在用这种方式告诉我，分开了就不要怀抱希望，现实，梦中都不能。\n\n我们在一起时，身边的朋友都知道，爱你，是他们都知道的事情，后来分开，只有少部分人知道，可是没有人知道我还爱你，这是属于我一个人的秘密。\n\n后来的我一直单身，有时候朋友开玩笑说“你是不是还没有忘掉他”我说“怎么可能，我这么拿的起放的下的人，早忘了。”回答的干脆利落，以至于他们都信了，说的多了，连我都几乎信了。\n\n可是，那为何会在听到你的名字时心头一震，为何会在不经意间想起你的时候心底隐隐难受，为何会在街上看到一个和你相似的背影心脏漏停一秒，为何总是会入我的梦，又为何对后来身边出现的男生都无感，直至今日，你依然是我拒绝别人的理由。我没有在等你，却还是喜欢不上别人。\n\n会偷偷地跑到你的空间，因为当时在一起的时候微信还没有如此盛行，那时候会要求你弄成情侣头像，关联qq号，设置成情侣空间，有空了就一直在你空间留言，后来我们的qq不再关联，你也换了头像，换了空间装扮，清空了所有留言。我偷偷地溜进去转了一圈，然后默默地删除访问记录。想知道你的消息，又怕你知道我还在惦记。\n\n会偷偷地跑到你的城市，在我们经常走过的那条小路转转，呼吸着这座城市的空气，吹着和你一样的风，算不算相拥？\n\n也会一个人背着包到处旅行，记得和你说过很多想要去的地方，你总说等咱有钱了，想去哪去哪，你总说等有机会了，去很多地方。可是直到分开还是没有去过任何一个地方，我一个人走走停停，看一起说过的风景，而你在哪里？\n\n在一起两年的光景，用了三年的时间念念不忘，回忆比经历还要长，该说自己太痴情还是太想不开呢？\n\n其实有时候我们的内心远远没有表面那么潇洒，背影一转身就可以，而心里的空缺要怎样去填平？离开后的日子我瞒着所有人爱了你好久好久，我想这应该是我说分手的代价吧。但是该偿还的三年时光已经够了吧，剩下的我只想活给自己看。\n\n以前总希望你能来，会突然站在我的面前，会给我打电话让我到楼下给我惊喜，会轻轻地说一句“别来无恙”可是现在我不想要了，那些无处安放的情感就让它各自归位，你别来，我一个人也无恙。",
        collection: 92,
        dateTime: "24小时前",
      headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=b0f8cff98c5591d5c581401dc548f2cb&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fblog%2F201404%2F27%2F20140427225617_GGKAH.thumb.700_0.jpeg",
        author: "迷的城",
        date: "Nov 20 2019",
        avatar: "/images/avatar/1.png",
        postId: 1,
        collectFlag: false,
        shareFlag: false,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/468032f2f8cc81ceacb6a277b1adcd03/599516324/599516324.mp3?xcode=4e08706b5b8f2a3305ffee87c3adb48c",
            title: "In Your Eyes",
            coverImg: "http://qukufile2.qianqian.com/data2/music/E53897962DE2D5CA3395BADD2F4A1DA9/252255858/252255858.jpg@s_2,w_500,h_500"
        }
    },
    {
        id: 3,
        title: "时光荏苒，蹉跎了谁的年华",
        content: "当清晨的一缕阳光透过窗帘上的空隙映照在沉睡的脸庞时，微微张开的双眼朦胧地注视着周遭的一切，新的一天悄然而至。",
        detail: "　当清晨的一缕阳光透过窗帘上的空隙映照在沉睡的脸庞时，微微张开的双眼朦胧地注视着周遭的一切，新的一天悄然而至。\n\n——题记\n\n时光的单车飞快驶去，岁月的倒影也将消失，白天与黑夜不停的交替，轮回的四季斑驳了谁的岁月，蹉跎了谁的年华。一个人静静地与岁月交错，于平淡之中细细体会生活的深意，去注视，去聆听，去感受那些带着希望的别离以及那些经受沧桑的相逢，不论时光如何飞转，那些落花一样的往事，依然鲜活地存在于我的脑海之中。当岁月和美丽的回忆已成为风中的叹息，我们伤感的眼里也许依然残存旧时的泪痕，模糊了视线，不敢轻易触碰。\n\n生活的列车慢慢的前进，有些人下去，也有人上去，不慌不忙的过着行云流水的日子，有的人知道自己的前方在哪里停靠，生活充实而安逸，有些人庸庸碌碌的过着不起波澜的日子，每天无头鸟似的瞎忙，朦胧的眼神向世界宣告着昏暗思想，一个个皮囊悬浮在空气中，没有生机的灵魂过着糜烂的时间。没有归属，无处生根。有时我们在迷茫青春的时候，日子也慢慢地溜走，不留一点痕迹。\n\n时光不可阻挡，岁月交错中总要有些思量。人生只有在不短的思考中才会有所进步，有所追求，有了目标的人生才不会孤独和无助，只有让自己的心静下来时一些前方的东西才会明朗的展现在我们的面前。让我们不再迷惑于为所谓的挣扎中，谁的年华没有色彩，谁的青春没有耀眼的光芒，只是在岁月的长河里我们的选择不同，所得到的结局就不同，每个人都需要努力才会得到一切自己所要追求的东西和梦想。\n\n生命无常，人生苦短，记忆的时光中我们匆匆走过，走过喧嚣，走过孤寂，时光无情地带走了我们的青春年少，还好我们都在坚持着内心的宁静，岁月的年轮缓缓的从我们身边碾过，往事一幕幕铺陈，让我的生活回忆不至于那么的枯燥，一些美好的记忆还依然鲜活地根植在我的脑海之中。消逝不去，本不该怀旧的年纪，可是我们学不会遗忘，日日夜夜的想念，带着些许的小寂寞，心有不甘常常在无人的街角大声的长啸，发泄着内心的声音，有时候我们会选择相信宿命，认为人与人之间的相遇，就像是上天早已做了安排，人谁也逃不过岁月时光刻下的印迹。\n\n时光荏苒，蹉跎了谁的年华，匆匆行走的岁月长河中，有些人只顾着追寻他人的脚步，忘记了自己的方向，忘记了自己的目标和理想，有些人几顾思量不敢走出自己的道路，因而迷失了方向。迷失了自己。有些人默默坚守，把青春的岁月包裹在温热的怀里，载着它踏上梦想的征途，不留一丝遗憾。不留一点别人靠近的距离，就像是陈孝正为自己规划的一厘米的差距，人生没有从头来过的权利。亦没有后悔的权利，做过的事情，不管有些怎样的结局都会成为过往，我们纵使一味的活在过去的时光里也不会改变一点点发生的故事，向着远方，努力的看看前方的路才是对我们自己的肯定，只有心存希望，才会有拼搏的勇气，才有希望去走更远的路，因为值得，所以一路前行，\n\n那一路上的心酸往事，慢慢的沉淀在内心平和的深处！",
      imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=5ff9835fdd1154cafab23690297100a7&imgtype=0&src=http%3A%2F%2Fhbimg.b0.upaiyun.com%2Fe006be65e7e61eb0696753e5e4bc7f1dfa05c7691ca97-eSkPxK_fw658",
      headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=5ff9835fdd1154cafab23690297100a7&imgtype=0&src=http%3A%2F%2Fhbimg.b0.upaiyun.com%2Fe006be65e7e61eb0696753e5e4bc7f1dfa05c7691ca97-eSkPxK_fw658",
        reading: 62,
        collection: 92,
        author: "知乎",
        date: "Nov 12 2019",
        dateTime: "三天前",
        avatar: "/images/avatar/3.png",
        postId: 2,
        collectFlag: true,
        shareFlag: false,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/67551537/67551537.mp3?xcode=733ead86f432403e6f333bb99c6701d9",
            title: "Call My Name",
            coverImg: "http://qukufile2.qianqian.com/data2/music/8DB6724C59EB64C2DD8A6339D323BEE1/252263924/252263924.jpg@s_2,w_500,h_500"
        }
    },
    {
        id: 4,
        title: "原来,我们只是红尘世间的过客",
        content: "原来我们只是红尘世间的过客，三生石上面深深刻着缘分的痕迹，单单没有你和我，缘分是上面为何寻求的人是这么多，随着年轮的转换，时间的交替河水缓缓地流动，是岁月改变了人生的遗憾？还是人生改变了岁月？时间的流动让我遗忘了尘世间的一切，却让我无法以往曾经最美的邂逅。",
      imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=75af30dc6131e5ff8e75e009ce7e3774&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fitem%2F201806%2F08%2F20180608112636_pvtfh.jpeg",
        reading: 102,
        detail: "原来我们只是红尘世间的过客，三生石上面深深刻着缘分的痕迹，单单没有你和我，缘分是上面为何寻求的人是这么多，随着年轮的转换，时间的交替河水缓缓地流动，是岁月改变了人生的遗憾？还是人生改变了岁月？时间的流动让我遗忘了尘世间的一切，却让我无法以往曾经最美的邂逅。\n\n缘来缘去给我们留下了太多太多的忧伤，却始终无法遗忘，遗忘那段淡淡的忧伤\n\n忧伤的岁月我独自在漆黑的夜晚无声徘徊。遥望着夜空的星辰，心底泛起那段痛苦铭\n\n心幸福又忧伤的记忆。独自依靠在窗前回忆着曾经的点点，眼里却流出无名的泪水。在这宁静而且忧伤的夜里无力的叹息。\n\n尘世间有多少悲欢离合，不尽人意的错落，留下了一段刻骨铭心的记忆，然后在风尘中散落，而那刻骨铭心的伤痛，成了一种绵长的痛痒，不经意的就会揭开岁月遗留的疤痕。人的一生都在学着忘记，可又有那么多的身不由己，当时光划过夜晚的寂寞，淡淡的忧伤中浮现出的丝丝缕缕，总是感染着一种无奈的情绪。回忆，苍老了岁月，孤单了自己。\n\n总会为一段情感而困惑，那些精心的呵护为什么会成为风尘错落，是背负不起岁月的沧桑，还是经受不起时光的打磨？三生石上铭刻的字迹，为何单单缺少了你和我？那些诗情画意的章节是不是笔锋一转，就成了伤感的续写。常常静思己过，是自己不够温情，做得还不够好，还是情感太过脆弱，经受一点风雨就会夭折。而我们终究没有给岁月一个紧握，一台戏拆开来演，却成了彼此的旁观者。\n\n心与心的距离到底有多远，为何总是看不到彼此的位置。一念之间已是天涯，转身如此的简单，一条鸿沟的阻隔，终究成了无法摆渡的堤岸。时光逐渐老去，那么记忆可否风干？那些无意间就被拼接的画片，触摸着谁的疼痛，撕裂着谁的伤感。常常在雨中解读所有的心事，雨点强烈的敲打着玻璃窗，滴滴滑落都震撼着一种心伤。雨丝交织着烦乱的思绪，缠绕成了一个结。很想推开窗户奔赴雨中，进行强化的洗礼，任雨水洗刷所有的心碎，剥落所有的孤单。\n\n常常心存不甘，一段错落的邂逅竟然如此刻骨，如果说所有的心伤都是太过执着，不懂得洒脱的放手，那么由谁来安抚时光的遗落？总是心存疑问，究竟是岁月辜负了我，还是我拖累了岁月？要不然为何走不出自己搅乱的漩涡？总是沉默在一段段文字中读取，寻找着相同心情的章节，却发现所有的语句都表达的不够深刻。也曾深夜执笔，涂鸦着当初幸福相遇的轮廓，却一次次被忧伤所侵染，原来一个人的对白是如此的卑微，没有观众的独角戏是那么的苍白无力。\n\n一段情总要用一生来演才算完整，那么该如何导演一部完美的结局？红尘无期，我们都输给了耐力，在各种演变中成了彼此的看客。记忆它就像无法关闭的闸门，总在寂寥的午夜倾泻，伤感的触手被拉伸，在孤单中无情的撕扯着夜色。流星几经划过，满腹话语该如何倾诉。总在想，寂寞的午夜里，你又可否有过相同的失落？流星滑落的瞬间可否惊艳\n\n渐渐的学会了伪装，穿梭在俗世的喧嚣中用微笑包装着自己，却总是无法掩盖忧伤的眸光。如果说微笑是掩盖忧伤的良药，我又何尝不是一直寻找开心的理由。面对常常泛起的思潮，总是告诫自己不要太过固执，自编自演的独角戏不会得到任何宽慰，总是努力排解充斥在心头的淡淡愁绪，却怎么也找不到遗忘的借口。\n\n常常静默与时光的一角，细数流年看烟雨，飘散的朵朵流云又可曾理解天空的寂寞？牵强的挽留却终究抓不住那一缕温柔。尘世间总有那么多的情非得已，为一份心动倾情，却又怅然在失散中。总在想，假如没有这场华丽的邂逅，而你还是你，我还是我，那么彼此会不会都过着一种安逸的日子，守候着一份简单。假如再给我们一次遇见，那么可否抛下满目的繁华，拾起一地碎片拼接成春暖花开的惊艳。\n\n曾经以为身处春暖花开的季节，就会盈香满袖，可一个人的飘香又怎能演绎两个人的浪漫。满目的花开娇艳、蜂蝶蹁跹，更添涂了一份思念的孤单。年轮在增厚，我与一树风景对望，却被摇曳成了一枝柳条的清瘦。时光渐老，黑天与白昼不停的交替，而我选择了忙碌来掩盖内心的空虚。每当夜幕降临，与满天繁星对语，却忽略了散落一地的月华，池中倒映的一轮清影一样充满了孤单寂寞，原来它和我一样随风尘对默黑白，痴守着一场无言的结局。\n\n人生本无果，缘来缘去挽留不住的太多，若时光可以重来，我愿拾起一叶精美的叶片，抖落满身的伤感，裁出春天的模样，制成别致的书签盈香一份葱绿。若时光就这样老去，我愿化作一缕尘埃，忘记所有的忧伤，在经年的转角默默的堆积所有的往事不再提及。\n\n自导自演的独角戏要用一生来演绎，演绎着不同的悲剧喜剧。当时间能够停留在这段美好的记忆当中，我宁愿化作一阵无形的风影。人生最美的相遇却不过是一场忧伤的记忆，随着时光的飘逸却始终难以忘记忧伤中的点点滴滴。",
        collection: 92,
        dateTime: "24小时前",
      headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=75af30dc6131e5ff8e75e009ce7e3774&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fitem%2F201806%2F08%2F20180608112636_pvtfh.jpeg",
        author: "猫是猫的猫",
        date: "Nov 20 2019",
        avatar: "/images/avatar/5.png",
        postId: 3,
        collectFlag: false,
        shareFlag: true,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/124375653/124375653.mp3?xcode=733ead86f432403e5342a3548728ab76",
            title: "我只要…",
            coverImg: "http://qukufile2.qianqian.com/data2/pic/52d9210a2b3bb14c1d580f43efc9ea3b/268383767/268383767.jpg@s_2,w_500,h_500",
        }
    },
    {
        id: 5,
        title: "感情经不起平淡，友情经不起风雨",
        content: " 感情经不起平淡，友情经不起风雨，心静了，才能听见自己的心声，心清了，才能照见万物的本性。静静的过自己的生活，心若不动，风又奈何。你若不伤，岁月无恙。在乎你的人，会在乎你的感受，不会让你难受；不在乎你的人，不会在乎你的难过，你又何必舍不得。爱是彼此的珍惜，也是双方的在意；情是柔弱的花朵，用心呵护才会醇香。若爱请珍爱，不爱请放手，尊重别人也是尊重自己，彼此安好便是晴天。",
      imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=a663685f7481daaebc2063b552af9202&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fitem%2F201208%2F05%2F20120805120526_FnART.jpeg",
        reading: 102,
        detail: "感情经不起平淡，友情经不起风雨，心静了，才能听见自己的心声，心清了，才能照见万物的本性。静静的过自己的生活，心若不动，风又奈何。你若不伤，岁月无恙。在乎你的人，会在乎你的感受，不会让你难受；不在乎你的人，不会在乎你的难过，你又何必舍不得。爱是彼此的珍惜，也是双方的在意；情是柔弱的花朵，用心呵护才会醇香。若爱请珍爱，不爱请放手，尊重别人也是尊重自己，彼此安好便是晴天。\n\n有的人用尽全力珍惜你，你却不在意；有颗心一直为你等待，你却视而不见。有多少情，不被重视，所以走开；有多少身影，不被珍惜，变成背影。感情，不去论对与错，只有真不真；缘分，不去说长与短，只有惜不惜。把你放在心里的人，或许只是平静地相守；始终视你为唯一的，或许只是默默地等待。人总是不懂得知足，总以为唾手可得的随意就有；心有时会犯迷糊，看不到平淡背后的幸福。别用自己的骄傲伤一份珍贵的缘，别让自己的冷漠疏一颗难得的心。\n\n有一种爱，明明是深爱，却说不出来；有一种爱，明明想放弃，却无法放弃；有一种爱，明知是煎熬，却又躱不开；有一种爱，明知无前路，心却早已收不回来。 快乐疼不疼？放过她，但放不过自己。有些事一转身就一辈子。 最初不相识，最后不相认。 如果爱情只是路过，又何必到此一游。 有些爱， 不得不 各安天涯，蓦然回首，我已无力诉说。时间总会给你答案，谁才是真正疼你，真正在乎你的人；谁又是你在乎，却又毫不在乎你的人。有些人不值得太过珍惜，有些情却值得好好珍爱。\n\n当我面朝大海的时候， 别人正春暖花开，当我想和大海一起死去，而它却已先成为死海，我有很多回忆是关于你的，可是你偏执的认为你不过是个路人甲。我想和你在一起，哪怕是出无头无尾的闹剧，我也会坚持到你退场后全世界黯淡下来的那一刻，执一盏小灯，站在回忆里等你。只是希望能有个人，在我说没事的时候，知道我不是真的没事；能有个人，在我强颜欢笑的时候，知道我不是真的开心。\n\n 因为有了你，其他人都成为了将就。有些事，经不起再一次。我一生中最幸运的两件事，一件，是时间终于将我对你的爱消耗殆尽 ，一件，是很久很久以前有一天，我遇见你，如果。所有的伤痕都能够痊愈。如果。所有的真心都能够换来真意。如果。所有的相信都能够坚持。如果。所有的情感都能够完美。如果。依然能相遇在某座城。单纯的微笑。微微的幸福。肆意的拥抱。 该多好。可是真的只是如果。\n\n一些人遇见了，一些人失去了，也许生活就是这样，四季流转着，最后又会留下谁，陪伴在身旁。似乎开始越来越多的失去，代替了所得。那些岁月中深深浅浅的痕迹，那些无法定格的记忆，又要如何取舍。寻一杯冰冷的水，来解救干渴的喉咙。写一些忧伤的文字，记录着一些琐碎的生活。十指相握给自己取暖，只能维持的瞬间。谁说，懂得放开，心胸便会坦然。我微笑，是不是真的懂得成全。文字，短信，电话，线上消息。\n\n我开始让一些人渐渐淡出我的生活。我不相信这个世界有什么可以永远。你不是我的，我亦不是你的。我的心那么小，可以遇见的人不多，可以付出的，亦只有那么几个。记忆里残存的温柔，终会抵不过眼前平时的幸福。哪怕它，只是一个小小的光点，所以，我们亦只能看见眼前，然后简单的生活，区别的，只是心而已。\n\n她说：“你会找到一个比我更好的人， 我微笑说：“但我不会再对人这么好了。”该笑的时候没有快乐，该哭泣的时候没有眼泪，该相信的时候没有诺言。用假的名字是因为要说真的故事。该坚持的时候，却放开了你的手。放开你，不是因为我不爱你，是因为我太爱你时间不会改变痛，时间只能适应痛。隔阂着我们的并非他人，是世俗。窒息的沉默，悲伤的是我，不是你，\n\n多少次又多少次，回忆把生活划成一个圈，而我们在原地转了无数次，无法解脱。总是希望回到最初相识的地点，如果能够再一次选择的话，以为可以爱得更单纯。 把眼泪留给最疼你的人，把微笑留给伤你最深的人。 两心之间，最好的情，莫过于一份心安；两人之间，最好的感觉，莫过于一份心甘。爱是一份情愿，更是一份知足。\n\n哭过的眼睛看岁月更清楚，痛过的心会更懂呵护幸福，所以放开他的手，我会微笑朝前走，他曾经给我的爱会继续温暖我的未来，至于伤害，交由时光掩埋。 或许是因为泪太真了，所以有些心颤。云，终究是云。不过，它委屈时，也会落泪，那便是雨。没有人值得你流泪，值得你流泪的人不会让你哭泣。 传说有一个无泪之城，城里的人开始是因为只有快乐而没有眼泪，后来是因为眼泪流干了。\n\n眼泪撒落一地，再也捡不回来了。爱是心疼你的心疼，爱惜你的爱惜；爱更是看穿你的脆弱，包容你的逞强，接受你的小气，依旧不离的笃定！从来不需要想起，因为从来未曾忘记。和你一同笑过的人，有可能把他忘记，但是和你一同哭过的人，你却永远忘不了。花开了，又谢了，只有荷叶还撑着，痴情地回忆花的容颜。爱就像拔河，一个人放掉，另一个人就会受伤。火车的一头是永远的牵挂，另一头则是永远的向往。我在河的对岸观望我的青春， 看得平静又伤感。\n\n人这一生，总有不愿接受的现实，不想承受的心情。总是掏心掏肺去面对，却得不到领情领意的善待；一直倾心倾情去守候，却等不来良心发现的回头。痛，不过感情；伤，不过心灵。认真到死心塌地，却输的一败涂地；专一到不留余地，却冷的忘了哭泣。期望着被看重，却被排到了最后；抱着希望而来，却带着失望而归。感情经不起平淡，友情经不起风雨。",
        collection: 26,
        dateTime: "24小时前",
      headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216485&di=a663685f7481daaebc2063b552af9202&imgtype=0&src=http%3A%2F%2Fb-ssl.duitang.com%2Fuploads%2Fitem%2F201208%2F05%2F20120805120526_FnART.jpeg",
        author: "深白色",
        date: "Nov 20 2019",
        avatar: "../../../images/avatar/3.png",
        postId: 4,
        collectFlag: false,
        shareFlag: false,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/65535563/65535563.mp3?xcode=1f912c6bd598304bb4504f1dc3711450",
            title: "很久以前",
            coverImg: "http://qukufile2.qianqian.com/data2/pic/debf85eaa1271ae4e2bc817ed3178987/261958322/261958322.jpg",
        }
    },
    {
        id: 6,
        title: "最远的你，是我最近的爱",
        content: "陌上红尘，一念花开，雅致了一段别样的年华，丰染了一季墨香的眷恋，有你的时光，或多或少总是阳光明媚。因为你，这个夏天显得不再枯燥乏味，因为你，生活多了一份乐趣，因为你，生命多了一份色彩，因为你，心多了一份无言的欢乐。爱是刻进心里的念，爱是融进生命的暖，我的爱，是心中永远不变的眷恋。感谢我的生命有你相伴，感谢遇见，在温润的时光里散发着淡淡的清香。",
      imgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216484&di=b5d80929acdeec18d31380954f7d9410&imgtype=0&src=http%3A%2F%2Fwww.dongao.com%2Fupload%2Fresources%2Fimage%2F2017%2F04%2F18%2F61906.jpg",
        reading: 96,
        detail: "最远的你，是我最近的爱。人生有多少相遇，温柔了多少岁月；有多少相逢，明媚了多少时光；又有多少回眸，浸润了多少醉人的情怀。淡淡的时光，美好的相遇，与你相逢于浅夏，走过落英缤纷的深秋，随着时间的推移，随着季节的转换，心底的思念越来越浓，越来越深。茫茫人海，几多相逢，又有几人能驻足心灵，成为生命的永恒。相遇平淡，却入心温暖；美丽相伴，却倾入心田，不知何时起，你已悄悄驻入我的灵魂，融入我的生命，情心互润，爱恋共暖。\n\n陌上红尘，一念花开，雅致了一段别样的年华，丰染了一季墨香的眷恋，有你的时光，或多或少总是阳光明媚。因为你，这个夏天显得不再枯燥乏味，因为你，生活多了一份乐趣，因为你，生命多了一份色彩，因为你，心多了一份无言的欢乐。爱是刻进心里的念，爱是融进生命的暖，我的爱，是心中永远不变的眷恋。感谢我的生命有你相伴，感谢遇见，在温润的时光里散发着淡淡的清香。\n\n缘，是一种很奇妙的东西，也是人世间最美好的情怀。世间的缘，聚聚散散，分分合合，茫茫人海，有多少擦肩而过；漫漫一生，有多少真诚守候。有心的人，总会驻足，不再徘徊。有一种遇见，没有惊艳的开场，没有华丽的语言，普通的问候，简单的交流，一举一动，醉入眼眸；一字一句，温暖入心。未曾邀约，却心有灵犀；未曾谋面，却深植心田；未曾相见，却深深相恋。轻捻指间，那些游走的岁月，掬一捧相思，守一份淡泊，将一腔柔情安放在文字里，与你相约在梦里，轻轻爱，暖暖伴，静静相依走过如水流年。爱在心间，情在远方，真爱无所谓遥远，今生愿隔着天涯的距离，默默守候，静静相伴。\n\n茫茫人海，相遇一个人，该需要多少缘分，相守一份情，又需要多少勇气。遇见，柔润了谁的情，惊艳了谁的眼，情到深处无由，爱到浓时无语，珍惜一个人，是深深的疼惜，是绵绵的眷恋，当心与心，互爱生温，当情与情，互敬共暖，那就是一场魂与魂的相牵，是一次情与情的相恋，两两相惜心相念，心心相印永相伴。红尘想念，流年风月，温暖了流逝的岁月，虽然我们远隔天涯，却彼此相互牵挂，彼此牵绊，一生深爱的你；虽然我们相距万水千山，彼此却有一颗真诚的心，让真爱永存心底。万水千山隔不断心的思念，天涯路远阻不断心的眷恋，爱一个人不需要理由，只要暖着就好，走着最真。\n\n一抹温柔的牵系，深深浅浅的眷恋，溅湿了季节的思念，一季又一季的守望，丰润了流年，静好了岁月，茫茫人海，几许牵念，漫漫红尘，几许爱恋，隔着天涯，我们用最远的距离，感知最近的心灵；爱在心中，我们用最近的心，感知最远的彼此。有心的人，远在天涯，近在咫尺；无心的人，近在咫尺，却远在天涯。心若相知，无需多言，也能默契相通；情若相融，无需承诺，也能长久守候。\n\n生命中总有不期而遇的感动，深深植入心田，你的好，你的真，你的情，你的爱，亦或是你那永不言弃的执着，让心深深疼惜，深深眷恋。走过漫漫红尘，总会有人毫无怨由的喜欢着你的一切，喜欢着你的信笔涂鸦，你的真诚，你的平凡，你的简单，还有你那如水的深情。\n\n一生的光阴总会有人在合适的距离，给你别样的感动和入心的温暖，走过清浅时光，那些温暖的记忆，沉淀为心底最柔软的思念，在细暖的心间流淌。纵然你我相隔千里，你在我的记忆深处，永远也走不出我的思念。想你时，你是我唇边最温润的笑意；想你时，你是我梦中最甜美的爱恋；你的陪伴，我的温暖，轻轻牵着时光的手，相携走远；你的温柔，我的眷恋，默默颤动一袭柔软，蔓延在心间。今生与你，冷暖相伴，此生，与你爱染流年，即使寂寞忧伤随行，我亦不悔。知己，相交于心灵，相吸于灵魂，是不言的美丽，是不悔的深情，遥遥千里，我用一双眼深情的读你；不言不语，我用一颗心默默懂你，用心感受，且行且惜。\n\n剪一段流年的时光，握一路相随的暖，千山万水隔不断万般思念；万里之遥止不住情思万千，你是我今生的思念，你是我心中的挂牵。用真诚谱写四季恋歌，用快乐点缀美丽人生，让你我成为彼此心灵深处的永恒，你的柔情总有我懂，我的爱恋为你而生，你的岁月里有我的印记，我的人生中有你的回忆。一份缘让我们相遇，一根网线让我们相识，一份真情让我们相知，一份真诚让我们相牵，爱在疼惜中长大，情在珍惜中长久。\n\n爱在天涯，用最近的心感知最远的彼此，是不言的美丽；情在心间，用最深的懂得，疼惜着彼此，是不语的默契，轻轻笑，浅浅醉，平淡的相守，最真切；淡淡喜，深深爱，温暖的呵护，最贴心，最美的情，就是珍惜；最好的爱，就是好好被爱，好好疼爱，爱，相守便是温暖，情懂得便是最美。想你在天涯，爱你在心中，只要心中有爱，无所谓天涯遥远；只要眼中有情，无所谓海角天边。最美的情，最暖的伴，最真的爱，你是我今生无悔的邂逅；远在天涯的人，近在心里的情，不能拥有的梦，甘愿守候的心，最远的你，是我最近的爱。",
        collection: 26,
        dateTime: "21小时前",
      headImgSrc: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216484&di=b5d80929acdeec18d31380954f7d9410&imgtype=0&src=http%3A%2F%2Fwww.dongao.com%2Fupload%2Fresources%2Fimage%2F2017%2F04%2F18%2F61906.jpg",
        author: "深白色",
        date: "Nov 20 2019",
      avatar: "https://timgsa.baidu.com/timg?image&quality=80&size=b9999_10000&sec=1562085216484&di=b5d80929acdeec18d31380954f7d9410&imgtype=0&src=http%3A%2F%2Fwww.dongao.com%2Fupload%2Fresources%2Fimage%2F2017%2F04%2F18%2F61906.jpg",
        postId: 5,
        collectFlag: true,
        shareFlag: true,
        music: {
            url: "http://zhangmenshiting.qianqian.com/data2/music/65535563/65535563.mp3?xcode=1f912c6bd598304bb4504f1dc3711450",
            title: "很久以前",
            coverImg: "http://qukufile2.qianqian.com/data2/pic/debf85eaa1271ae4e2bc817ed3178987/261958322/261958322.jpg",
        }
    },
]

// 1-新歌榜,2-热歌榜,11-摇滚榜,12-爵士,16-流行,21-欧美金曲榜,22-经典老歌榜,23-情歌对唱榜,24-影视金曲榜,25-网络歌曲榜
var musicCategory = [
    {
        id: 1,
        name: '新歌榜'
    },
    {
        id: 2,
        name: '热歌榜'
    },
    {
        id: 11,
        name: '摇滚榜'
    },
    {
        id: 12,
        name: '爵士'
    },
    {
        id: 16,
        name: '流行'
    },
    {
        id: 21,
        name: '欧美金曲榜'
    },
    {
        id: 22,
        name: '经典老歌榜'
    },
    {
        id: 23,
        name: '情歌对唱榜'
    },
    {
        id: 24,
        name: '影视金曲榜'
    },
    {
        id: 25,
        name: '网络歌曲榜'
    }
]
module.exports = {
    postList: local_database,
    musicCategory: musicCategory
}